## Series

In [ ]:
Pandas Series is an One Dimensional Array
Single Column is consisdered as Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
s1 = pd.Series()
s1

<ipython-input-3-199a7cdf1889>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1 = pd.Series()

Series([], dtype: float64)

In [4]:
print(type(df),'\n',type(s1))

<class 'pandas.core.frame.DataFrame'>
 <class 'pandas.core.series.Series'>

In [5]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s1 = pd.Series([1,2,3,4,5,np.nan])
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [7]:
array = np.random.randint(10,100,size = (5,4))
df = pd.DataFrame(array, columns=list('ABCD'))
df

    A   B   C   D
0  12  27  50  57
1  40  82  14  63
2  27  22  59  12
3  35  70  91  28
4  65  94  99  63

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(df['A'])

pandas.core.series.Series

In [10]:
df['E']= [1,2,3,4,5]
df

    A   B   C   D  E
0  12  27  50  57  1
1  40  82  14  63  2
2  27  22  59  12  3
3  35  70  91  28  4
4  65  94  99  63  5

In [11]:
df['F'] = np.array([1,2,3,4,5])
df

    A   B   C   D  E  F
0  12  27  50  57  1  1
1  40  82  14  63  2  2
2  27  22  59  12  3  3
3  35  70  91  28  4  4
4  65  94  99  63  5  5

In [12]:
df['G'] = pd.Series([1,2,3,4])
df

    A   B   C   D  E  F    G
0  12  27  50  57  1  1  1.0
1  40  82  14  63  2  2  2.0
2  27  22  59  12  3  3  3.0
3  35  70  91  28  4  4  4.0
4  65  94  99  63  5  5  NaN

In [13]:
df['H'] = pd.Series([1,2])
df

    A   B   C   D  E  F    G    H
0  12  27  50  57  1  1  1.0  1.0
1  40  82  14  63  2  2  2.0  2.0
2  27  22  59  12  3  3  3.0  NaN
3  35  70  91  28  4  4  4.0  NaN
4  65  94  99  63  5  5  NaN  NaN

In [14]:
s1 = df['B']
s1

0    27
1    82
2    22
3    70
4    94
Name: B, dtype: int32

In [15]:
s1[4]

94

In [16]:
s1.loc[4]

94

In [17]:
s1.iloc[4]

94